In [1]:
import matplotlib.pyplot as plt
import numpy as np
import seaborn
import pandas as pd
from pandas import DataFrame, Series
%matplotlib inline

In [38]:
batting_data = pd.read_csv('Data/core/Batting.csv', sep = ",", dtype = str, names = ['playerID', 'yearID', 'stint','teamID', 'IgID', 'G', 'AB', 'R', 'H' ,'2B', '3B', 'HR', 'RBI', 'SB', 'CS', 'BB','SO', 'IBB', 'HBP', 'SH', 'SF', 'GIDP'])

In [39]:
batting_data.head()

,playerID,yearID,stint,teamID,IgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
1,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0,0,0,0,0,NaN,NaN,NaN,NaN,NaN
2,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13,8,1,4,0,NaN,NaN,NaN,NaN,NaN
3,allisar01,1871,1,CL1,NaN,29,137,28,40,4,...,19,3,1,2,5,NaN,NaN,NaN,NaN,NaN
4,allisdo01,1871,1,WS3,NaN,27,133,28,44,10,...,27,1,1,0,2,NaN,NaN,NaN,NaN,NaN

In [40]:
salary_data = pd.read_csv('Data/core/Salaries.csv', sep = ",", dtype = str, names = ['yearID', 'teamID', 'IgID', 'playerID', 'salary'])

In [41]:
salary_data.head()

   yearID  teamID  IgID   playerID  salary
0  yearID  teamID  lgID   playerID  salary
1    1985     ATL    NL  barkele01  870000
2    1985     ATL    NL  bedrost01  550000
3    1985     ATL    NL  benedbr01  545000
4    1985     ATL    NL   campri01  633333

In [42]:
amalgamated_data = pd.merge(batting_data, salary_data)

In [43]:
amalgamated_data.head()

,playerID,yearID,stint,teamID,IgID,G,AB,R,H,2B,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,salary
0,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,salary
1,ackerji01,1985,1,TOR,AL,61,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,170000
2,agostju01,1985,1,CHA,AL,54,0,0,0,0,...,0,0,0,0,0,0,0,0,0,147500
3,aguaylu01,1985,1,PHI,NL,91,165,27,46,7,...,1,0,22,26,5,6,4,3,7,237000
4,alexado01,1985,1,TOR,AL,36,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,875000

In [47]:
amalgamated_data['salary'].head()

0    salary
1    170000
2    147500
3    237000
4    875000
Name: salary, dtype: object